resources/syllabus/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-06 Mon 08:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Physics Syllabus</title>
<meta name="author" content="Mr. Maxwell" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Physics Syllabus</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf6accf9">1. Physics</a>
<ul>
<li><a href="#org331ed76">1.1. Instructor: Tyler Maxwell</a></li>
<li><a href="#org512918f">1.2. Email: tyler.maxwell@lausd.net</a></li>
<li><a href="#orga73e4e4">1.3. Classroom: 305</a></li>
<li><a href="#org371b5d4">1.4. Office Hours: After School, by appointment</a></li>
</ul>
</li>
<li><a href="#orgdf3992a">2. Course Overview</a></li>
<li><a href="#orge38f3c2">3. Course Goals</a></li>
<li><a href="#org106fb4b">4. Course Structure</a></li>
<li><a href="#orgc5420a0">5. Units of Study</a>
<ul>
<li><a href="#org84a7b58">5.1. Unit 1: Motion and Forces</a>
<ul>
<li><a href="#org264c7fd">5.1.1. Timeline: 3–4 weeks</a></li>
<li><a href="#org1ef9460">5.1.2. Topics:</a></li>
<li><a href="#orgfaab2f2">5.1.3. Key Activities:</a></li>
</ul>
</li>
<li><a href="#orgb881cc9">5.2. Unit 2: Momentum and Collisions</a>
<ul>
<li><a href="#orgf82a47d">5.2.1. Timeline: 3–4 weeks</a></li>
<li><a href="#org6babd8f">5.2.2. Topics:</a></li>
<li><a href="#org96f5402">5.2.3. Key Activities:</a></li>
</ul>
</li>
<li><a href="#orgcef529e">5.3. Unit 3: Foces at a Distance</a>
<ul>
<li><a href="#orgb79487b">5.3.1. Timeline: 3 weeks</a></li>
<li><a href="#org6ccd33c">5.3.2. Topics:</a></li>
<li><a href="#org93549c5">5.3.3. Key Activities:</a></li>
</ul>
</li>
<li><a href="#org98d8312">5.4. Unit 4: Energy Conversion</a>
<ul>
<li><a href="#orgd2232d8">5.4.1. Timeline: 2–3 weeks</a></li>
<li><a href="#orgb5fe77c">5.4.2. Topics:</a></li>
<li><a href="#orgb70f06c">5.4.3. Key Activities:</a></li>
</ul>
</li>
<li><a href="#org2d40c6a">5.5. Unit 6: Electricity and Magnetism</a>
<ul>
<li><a href="#org6604b0c">5.5.1. Timeline: 4 weeks</a></li>
<li><a href="#orgea9075d">5.5.2. Topics:</a></li>
<li><a href="#org8ba218d">5.5.3. Key Activities:</a></li>
</ul>
</li>
<li><a href="#org29576fe">5.6. Unit 7: Waves and Sound</a>
<ul>
<li><a href="#org301b88b">5.6.1. Timeline: 4 weeks</a></li>
<li><a href="#orgc53ad53">5.6.2. Topics:</a></li>
<li><a href="#orgaaadfc1">5.6.3. Key Activities:</a></li>
</ul>
</li>
<li><a href="#org9d4817b">5.7. Unit 8: Stars and the Universe (Time Permitting)</a>
<ul>
<li><a href="#org6fc5e37">5.7.1. Timeline: 2 weeks</a></li>
<li><a href="#org5b62a47">5.7.2. Topics:</a></li>
<li><a href="#org819e4ab">5.7.3. Key Activities:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org024890e">6. Assessments</a></li>
<li><a href="#orge3c01fe">7. Materials Required</a></li>
<li><a href="#org330cc6f">8. Class Policies</a></li>
<li><a href="#org77a1e86">9. Important Dates</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf6accf9" class="outline-2">
<h2 id="orgf6accf9"><span class="section-number-2">1.</span> Physics</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org331ed76" class="outline-3">
<h3 id="org331ed76"><span class="section-number-3">1.1.</span> Instructor: Tyler Maxwell</h3>
</div>
<div id="outline-container-org512918f" class="outline-3">
<h3 id="org512918f"><span class="section-number-3">1.2.</span> Email: <a href="mailto:tyler.maxwell@lausd.net">tyler.maxwell@lausd.net</a></h3>
</div>
<div id="outline-container-orga73e4e4" class="outline-3">
<h3 id="orga73e4e4"><span class="section-number-3">1.3.</span> Classroom: 305</h3>
</div>
<div id="outline-container-org371b5d4" class="outline-3">
<h3 id="org371b5d4"><span class="section-number-3">1.4.</span> Office Hours: After School, by appointment</h3>
</div>
</div>



<div id="outline-container-orgdf3992a" class="outline-2">
<h2 id="orgdf3992a"><span class="section-number-2">2.</span> Course Overview</h2>
<div class="outline-text-2" id="text-2">
<p>
Physics is the study of matter, energy, and their interactions. This course emphasizes critical thinking, problem-solving, and scientific inquiry. Topics will include motion, forces, energy, waves, electricity, and magnetism, with real-world applications. The course combines theoretical learning with practical, hands-on experiments.
</p>
</div>
</div>



<div id="outline-container-orge38f3c2" class="outline-2">
<h2 id="orge38f3c2"><span class="section-number-2">3.</span> Course Goals</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Develop an understanding of core physics principles.</li>
<li>Apply mathematical models to describe physical phenomena.</li>
<li>Engage in scientific practices such as experimentation, data analysis, and modeling.</li>
<li>Connect physics concepts to technology and everyday life.</li>
</ul>
</div>
</div>


<div id="outline-container-org106fb4b" class="outline-2">
<h2 id="org106fb4b"><span class="section-number-2">4.</span> Course Structure</h2>
<div class="outline-text-2" id="text-4">
<p>
The course is divided into units, each lasting approximately 2–4 weeks. Each unit includes lectures, hands-on labs, problem-solving sessions, and assessments.  
</p>
</div>
</div>


<div id="outline-container-orgc5420a0" class="outline-2">
<h2 id="orgc5420a0"><span class="section-number-2">5.</span> Units of Study</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org84a7b58" class="outline-3">
<h3 id="org84a7b58"><span class="section-number-3">5.1.</span> Unit 1: Motion and Forces</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org264c7fd" class="outline-4">
<h4 id="org264c7fd"><span class="section-number-4">5.1.1.</span> Timeline: 3–4 weeks</h4>
</div>

<div id="outline-container-org1ef9460" class="outline-4">
<h4 id="org1ef9460"><span class="section-number-4">5.1.2.</span> Topics:</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>Distance, displacement, speed, and velocity.</li>
<li>Acceleration and free fall.</li>
<li>Graphing motion: position-time, velocity-time, and acceleration-time graphs.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfaab2f2" class="outline-4">
<h4 id="orgfaab2f2"><span class="section-number-4">5.1.3.</span> Key Activities:</h4>
<div class="outline-text-4" id="text-5-1-3">
<ul class="org-ul">
<li>Lab: Motion on an inclined plane.</li>
<li>Simulations: Analyzing projectile motion.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb881cc9" class="outline-3">
<h3 id="orgb881cc9"><span class="section-number-3">5.2.</span> Unit 2: Momentum and Collisions</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgf82a47d" class="outline-4">
<h4 id="orgf82a47d"><span class="section-number-4">5.2.1.</span> Timeline: 3–4 weeks</h4>
</div>
<div id="outline-container-org6babd8f" class="outline-4">
<h4 id="org6babd8f"><span class="section-number-4">5.2.2.</span> Topics:</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li>Newton's laws of motion.</li>
<li>Free-body diagrams.</li>
<li>Friction, tension, and normal forces.</li>
<li>Applications of forces in real-life scenarios.</li>
</ul>
</div>
</div>
<div id="outline-container-org96f5402" class="outline-4">
<h4 id="org96f5402"><span class="section-number-4">5.2.3.</span> Key Activities:</h4>
<div class="outline-text-4" id="text-5-2-3">
<ul class="org-ul">
<li>Lab: Investigating frictional forces.</li>
<li>Problem Sets: Applications of Newton's laws.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcef529e" class="outline-3">
<h3 id="orgcef529e"><span class="section-number-3">5.3.</span> Unit 3: Foces at a Distance</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orgb79487b" class="outline-4">
<h4 id="orgb79487b"><span class="section-number-4">5.3.1.</span> Timeline: 3 weeks</h4>
</div>
<div id="outline-container-org6ccd33c" class="outline-4">
<h4 id="org6ccd33c"><span class="section-number-4">5.3.2.</span> Topics:</h4>
<div class="outline-text-4" id="text-5-3-2">
<ul class="org-ul">
<li>Work and energy transfer.</li>
<li>Kinetic and potential energy.</li>
<li>Conservation of energy.</li>
<li>Power and efficiency.</li>
</ul>
</div>
</div>
<div id="outline-container-org93549c5" class="outline-4">
<h4 id="org93549c5"><span class="section-number-4">5.3.3.</span> Key Activities:</h4>
<div class="outline-text-4" id="text-5-3-3">
<ul class="org-ul">
<li>Lab: Energy transformations in a pendulum.</li>
<li>Experiment: Measuring power output.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org98d8312" class="outline-3">
<h3 id="org98d8312"><span class="section-number-3">5.4.</span> Unit 4: Energy Conversion</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-orgd2232d8" class="outline-4">
<h4 id="orgd2232d8"><span class="section-number-4">5.4.1.</span> Timeline: 2–3 weeks</h4>
</div>
<div id="outline-container-orgb5fe77c" class="outline-4">
<h4 id="orgb5fe77c"><span class="section-number-4">5.4.2.</span> Topics:</h4>
<div class="outline-text-4" id="text-5-4-2">
<ul class="org-ul">
<li>Momentum and impulse.</li>
<li>Conservation of momentum.</li>
<li>Elastic and inelastic collisions.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb70f06c" class="outline-4">
<h4 id="orgb70f06c"><span class="section-number-4">5.4.3.</span> Key Activities:</h4>
<div class="outline-text-4" id="text-5-4-3">
<ul class="org-ul">
<li>Lab: Analyzing collisions using dynamic carts.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2d40c6a" class="outline-3">
<h3 id="org2d40c6a"><span class="section-number-3">5.5.</span> Unit 6: Electricity and Magnetism</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-org6604b0c" class="outline-4">
<h4 id="org6604b0c"><span class="section-number-4">5.5.1.</span> Timeline: 4 weeks</h4>
</div>

<div id="outline-container-orgea9075d" class="outline-4">
<h4 id="orgea9075d"><span class="section-number-4">5.5.2.</span> Topics:</h4>
<div class="outline-text-4" id="text-5-5-2">
<ul class="org-ul">
<li>Electric forces and fields.</li>
<li>Ohm’s law and simple circuits.</li>
<li>Series and parallel circuits.</li>
<li>Magnetism and electromagnetic induction.</li>
</ul>
</div>
</div>

<div id="outline-container-org8ba218d" class="outline-4">
<h4 id="org8ba218d"><span class="section-number-4">5.5.3.</span> Key Activities:</h4>
<div class="outline-text-4" id="text-5-5-3">
<ul class="org-ul">
<li>Lab: Building simple circuits.</li>
<li>Project: Constructing a basic electromagnet.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org29576fe" class="outline-3">
<h3 id="org29576fe"><span class="section-number-3">5.6.</span> Unit 7: Waves and Sound</h3>
<div class="outline-text-3" id="text-5-6">
</div>
<div id="outline-container-org301b88b" class="outline-4">
<h4 id="org301b88b"><span class="section-number-4">5.6.1.</span> Timeline: 4 weeks</h4>
</div>
<div id="outline-container-orgc53ad53" class="outline-4">
<h4 id="orgc53ad53"><span class="section-number-4">5.6.2.</span> Topics:</h4>
<div class="outline-text-4" id="text-5-6-2">
<ul class="org-ul">
<li>Types of waves: transverse and longitudinal.</li>
<li>Wave properties: frequency, wavelength, amplitude, and speed.</li>
<li>Sound waves and resonance.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaaadfc1" class="outline-4">
<h4 id="orgaaadfc1"><span class="section-number-4">5.6.3.</span> Key Activities:</h4>
<div class="outline-text-4" id="text-5-6-3">
<ul class="org-ul">
<li>Lab: Measuring wave properties with a slinky.</li>
<li>Experiment: Determining the speed of sound using resonance.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9d4817b" class="outline-3">
<h3 id="org9d4817b"><span class="section-number-3">5.7.</span> Unit 8: Stars and the Universe (Time Permitting)</h3>
<div class="outline-text-3" id="text-5-7">
</div>
<div id="outline-container-org6fc5e37" class="outline-4">
<h4 id="org6fc5e37"><span class="section-number-4">5.7.1.</span> Timeline: 2 weeks</h4>
</div>
<div id="outline-container-org5b62a47" class="outline-4">
<h4 id="org5b62a47"><span class="section-number-4">5.7.2.</span> Topics:</h4>
<div class="outline-text-4" id="text-5-7-2">
<ul class="org-ul">
<li>Basics of quantum mechanics.</li>
<li>Relativity: time dilation and mass-energy equivalence.</li>
</ul>
</div>
</div>
<div id="outline-container-org819e4ab" class="outline-4">
<h4 id="org819e4ab"><span class="section-number-4">5.7.3.</span> Key Activities:</h4>
<div class="outline-text-4" id="text-5-7-3">
<ul class="org-ul">
<li>Discussion: Quantum mechanics in everyday life.</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org024890e" class="outline-2">
<h2 id="org024890e"><span class="section-number-2">6.</span> Assessments</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Lab Reports and Experiments: 30%</li>
<li>Quizzes and Exams: 40%</li>
<li>Homework and Classwork: 20%</li>
<li>Participation and Engagement: 10%</li>
</ul>
</div>
</div>


<div id="outline-container-orge3c01fe" class="outline-2">
<h2 id="orge3c01fe"><span class="section-number-2">7.</span> Materials Required</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Textbook: Physics in the Universe</li>
<li>Scientific calculator.</li>
<li>Lab notebook or binder.</li>
<li>Ruler, protractor, and graph paper.</li>
</ul>
</div>
</div>


<div id="outline-container-org330cc6f" class="outline-2">
<h2 id="org330cc6f"><span class="section-number-2">8.</span> Class Policies</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>Attendance: Attendance is crucial for success. Missed labs or exams must be made up promptly.</li>
<li>Lab Safety: Adherence to all lab safety protocols is mandatory.</li>
<li>Late Work: Late submissions may receive partial credit unless prior arrangements are made.</li>
<li>Academic Integrity: Plagiarism or cheating will not be tolerated and will result in disciplinary action.</li>
<li>Participation: Active participation is encouraged and contributes to your grade.</li>
</ol>
</div>
</div>


<div id="outline-container-org77a1e86" class="outline-2">
<h2 id="org77a1e86"><span class="section-number-2">9.</span> Important Dates</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Midterm Exam: TBD</li>
<li>Final Exam: TBD</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mr. Maxwell</p>
<p class="date">Created: 2025-01-06 Mon 08:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
